{
  "examples": [
    {
      "id": "hydration-myths",
      "title": "9 Hydration Myths You Need to Stop Believing",
      "description": "Debunking common misconceptions about hydration and the '8 glasses a day' rule",
      "thread": "They've been misleading you about hydration for decades.\nThe \"8 glasses a day\" rule? A misinterpretation from 1945.\nSports drinks for everyone? Marketing disguised as health advice.\nHere are 9 hydration myths you need to stop believing:\n---\nFirst, some context.\nThe hydration industry is worth billions.\nThey profit from your confusion about basic health needs.\nBut the truth is simpler than they want you to believe...\n---\nMyth #1: \"You need 8 glasses of water a day.\"\nThis rule came from a 1945 government report — and even that report said most of the water comes from food.\nHydration needs depend on your body size, climate, and diet.\nOne-size-fits-all? Total myth.\n---\nMyth #2: \"Only drinks can hydrate you.\"\nUp to 20% of your hydration comes from food — especially fruits and veggies like watermelon, cucumber, and spinach.\nSoups, stews, and even oatmeal all count.\nHydration isn't just about what you drink — it's what you absorb.\n---\nMyth #3: \"If you're thirsty, you're already dehydrated.\"\nNot true. Thirst is a normal regulation signal, not a panic button.\nIt's possible to feel thirsty from things like spicy food or medications — even if your hydration is fine.\nListen to your body, but don't panic every time you crave a sip.\n---\nMyth #4: \"You can't overhydrate.\"\nYes, you can — and it's dangerous.\nIt's called hyponatremia — when you drink so much water that you dilute your blood sodium levels.\nIt can cause confusion, nausea, even seizures.\nBalance matters more than volume.\n---\nMyth #5: \"Coffee dehydrates you.\"\nCaffeine is a mild diuretic, but coffee still provides net hydration.\nStudies show that moderate caffeine intake hydrates similarly to water.\nYour morning coffee counts — don't let anyone tell you otherwise.\n---\nMyth #6: \"Sports drinks are the best way to rehydrate.\"\nUnless you're sweating hard for 60+ minutes, most sports drinks just give you sugar and food dye.\nFor mild hydration, stick with water — or water + a salty snack.\nYou don't need neon liquids to restore balance.\n---\nMyth #7: \"Water is always the best way to rehydrate.\"\nNot always.\nIf you're severely dehydrated (low BP, dizziness, confusion), water isn't enough.\nYou'll need electrolytes, IV fluids, or medical help — especially if your body can't absorb water properly.\n---\nMyth #8: \"Clear urine means you're perfectly hydrated.\"\nNot quite.\nPale yellow is ideal. Crystal-clear urine might mean you're flushing out minerals your body needs.\nHydration isn't just about water in — it's about nutrient retention.\n---\nMyth #9: \"More water = better skin.\"\nHydration helps, but water alone won't fix dry or aging skin.\nYour skin barrier needs healthy fats, sleep, hormones, and a balanced diet — not just another glass of water.\nDon't confuse internal hydration with surface glow.\n---\nThe truth about hydration is refreshingly simple.\nListen to your body's actual signals.\nEat water-rich foods.\nMatch your intake to your lifestyle.\nStop falling for expensive \"hydration solutions\" you don't need.",
    "videos": [
        "https://youtu.be/iIhQaWcFz6M?si=CohHjeBTxqLbjNvx",
        "https://youtu.be/y3hcIc34Ipk?si=hYeZeGzIOrd5abY6",
        "https://youtube.com/shorts/pt_GJzwbD3c?si=CdCVyHFLbjgIPhLf",
        "https://youtu.be/XG8olDy4aaU?si=lo4ndZFQ1rvRn9MB",
        "https://youtu.be/1rpH8N4FmXI?si=xDHZwHd5g1s1Hu80",
        "https://youtu.be/-w-FhctMvD0?si=ufdVVhqnaNQ6jDqc",
        "https://youtu.be/i0h7N1ukZ4A?si=zzyUGsxmGTfwPkk0",
        "https://youtu.be/FwdqFHBaPwY?si=ckqS78WqQ6aV-_WT",
        "https://youtu.be/iIhQaWcFz6M?si=DleWWADCuhX13GwI"
      ]
    }
  ]
} 